{
  "attributes": {
    "dataSource.vendor": "Cisco",
    "dataSource.name": "Cisco Duo Security",
    "dataSource.category": "security",
    "metadata.product.vendor_name": "Cisco",
    "metadata.product.name": "Cisco Duo Security",
    "metadata.version": "1.0.0"
  },
  "formats": [
    {
      "format": "$unmapped.{parse=json}$",
      "rewrites": [
        {
          "input": "unmapped.timestamp",
          "output": "timestamp",
          "match": ".*",
          "replace": "$0"
        },
        {
          "input": "unmapped.time",
          "output": "time",
          "match": ".*",
          "replace": "$0"
        }
      ]
    }
  ],
  "mappings": {
    "version": 1,
    "mappings": [
      {
        "predicate": "unmapped.class_uid = '3002'",
        "transformations": [
          {
            "constant": {
              "value": 3002,
              "field": "class_uid"
            }
          },
          {
            "constant": {
              "value": "Authentication",
              "field": "class_name"
            }
          },
          {
            "constant": {
              "value": 3,
              "field": "category_uid"
            }
          },
          {
            "constant": {
              "value": "Identity & Access Management",
              "field": "category_name"
            }
          },
          {
            "copy": {
              "from": "unmapped.activity_id",
              "to": "activity_id"
            }
          },
          {
            "copy": {
              "from": "unmapped.activity_name",
              "to": "activity_name"
            }
          },
          {
            "copy": {
              "from": "unmapped.type_uid",
              "to": "type_uid"
            }
          },
          {
            "copy": {
              "from": "unmapped.severity_id",
              "to": "severity_id"
            }
          },
          {
            "copy": {
              "from": "unmapped.status_id",
              "to": "status_id"
            }
          },
          {
            "copy": {
              "from": "unmapped.status",
              "to": "status"
            }
          },
          {
            "copy": {
              "from": "unmapped.message",
              "to": "message"
            }
          },
          {
            "copy": {
              "from": "unmapped.user.name",
              "to": "user.name"
            }
          },
          {
            "copy": {
              "from": "unmapped.user.account_uid",
              "to": "user.account_uid"
            }
          },
          {
            "copy": {
              "from": "unmapped.user.account_type",
              "to": "user.account_type"
            }
          },
          {
            "copy": {
              "from": "unmapped.src_endpoint.ip",
              "to": "src_endpoint.ip"
            }
          },
          {
            "copy": {
              "from": "unmapped.src_endpoint.location.desc",
              "to": "src_endpoint.location.desc"
            }
          },
          {
            "copy": {
              "from": "unmapped.src_endpoint.location.city",
              "to": "src_endpoint.location.city"
            }
          },
          {
            "copy": {
              "from": "unmapped.src_endpoint.location.country",
              "to": "src_endpoint.location.country"
            }
          },
          {
            "copy": {
              "from": "unmapped.auth_protocol",
              "to": "auth_protocol"
            }
          },
          {
            "copy": {
              "from": "unmapped.auth_protocol_id",
              "to": "auth_protocol_id"
            }
          },
          {
            "copy": {
              "from": "unmapped.mfa_factors",
              "to": "mfa_factors"
            }
          }
        ]
      }
    ]
  },
  "observables": {
    "fields": [
      {
        "name": "user.name",
        "type": "User"
      },
      {
        "name": "src_endpoint.ip",
        "type": "IP Address"
      },
      {
        "name": "auth_protocol",
        "type": "Other"
      }
    ]
  }
}